# [Python Reference Link](http://www.data8.org/sp20/python-reference.html)
*Run the cell below so that we can set our modules up*

In [1]:
import numpy as np
from datascience import *

In [2]:
# These lines set up graphing capabilities.
import matplotlib
%matplotlib inline
import matplotlib.pyplot as plt
plt.style.use('fivethirtyeight')
import warnings
warnings.simplefilter('ignore', FutureWarning)

from ipywidgets import interact, interactive, fixed, interact_manual
import ipywidgets as widgets

# Regarding the demo request

After writing this, you realize you also wanted to print out the 2nd and 3rd-highest years.  Instead of copying your code, you decide to put it in a function.  Since the rank varies, you make that an argument to your function.

**Question 1.4.** Write a function called `print_kth_top_movie_year`.  It should take a single argument, the rank of the year (like 2, 3, or 5 in the above examples) and should use the table `movies_by_year`. It should print out a message like the one above.  

*Note:* Your function shouldn't have a `return` statement.

In [ ]:
def print_kth_top_movie_year(k):
    ...
    print(...)
  

# Example calls to your function:
print_kth_top_movie_year(2)
print_kth_top_movie_year(3)

In [ ]:
# interact also allows you to pass in an array for a function argument. It will
# then present a dropdown menu of options.
_ = interact(print_kth_top_movie_year, k=np.arange(1, 10))

### In response: 
`interact` comes from the `ipywidgets` module: [https://ipywidgets.readthedocs.io/en/stable/examples/Using%20Interact.html#](https://ipywidgets.readthedocs.io/en/stable/examples/Using%20Interact.html#)

# Demo for `tbl.join`
<img src="table_join.png" alt="drawing" width="1200"/>

In [10]:
drinks = Table.read_table('drinks.csv')
discounts = Table.read_table('discounts.csv')

drinks.show()
discounts.show()

In [5]:
drinks.join('Cafe',discounts,'Location')

Cafe   | Drink    | Price ($) | Coupon
Asha   | Milk Tea | 5.5       | 10%
Asha   | Milk Tea | 5.5       | 5%
Strada | Espresso | 1.75      | 25%
Strada | Latte    | 3.25      | 25%

In [12]:
discounts

Coupon | Location
10%    | Asha
25%    | Strada
5%     | Asha

In [13]:
discounts = discounts.relabeled('Location','Cafe')
discounts

Coupon | Cafe
10%    | Asha
25%    | Strada
5%     | Asha

In [14]:
drinks.join('Cafe',discounts)

Cafe   | Drink    | Price ($) | Coupon
Asha   | Milk Tea | 5.5       | 10%
Asha   | Milk Tea | 5.5       | 5%
Strada | Espresso | 1.75      | 25%
Strada | Latte    | 3.25      | 25%

# Using Pivot Tables to Analyze Credit/Debit Card Statements

Importing the csv file and storing it in the `spending` table

In [15]:
spending = Table.read_table('2022_CC_Transactions.csv')

In [51]:
#Take a look at all of your expenses
spending.show(10)

Now, let's reformat our transaction dates so that it only reports the month and year. We aim to examine how our spending habits change month-to-month.

In [24]:
spending.column('Transaction Date').item(0)

'2022-12-29'

In [31]:
def extract_month_year(date):
    ...
    return date[:7]

In [32]:
extract_month_year('2022-12-29')

'2022-12'

In [40]:
transaction_array = spending.apply(extract_month_year,'Transaction Date')
spending = spending.with_column('Transaction',transaction_array).where('Debit',are.above(0))
spending.pivot('Transaction','Category','Debit',sum).drop('2021-12')

Category       | 2022-01 | 2022-02 | 2022-03 | 2022-04 | 2022-05 | 2022-06 | 2022-07 | 2022-08 | 2022-09 | 2022-10 | 2022-11 | 2022-12
Airfare        | 92.96   | 378.5   | 0       | 0       | 0       | 0       | 0       | 43.98   | 0       | 0       | 0       | 162.96
Dining         | 879.63  | 1788.52 | 3170.98 | 1139.2  | 1333.11 | 2573.59 | 2386.9  | 1931.08 | 1707.13 | 2493.05 | 3525.21 | 3469.5
Entertainment  | 0       | 0       | 38.72   | 0       | 0       | 0       | 0       | 0       | 0       | 0       | 0       | 0
Gas/Automotive | 173.94  | 167.62  | 169.62  | 298.2   | 263.09  | 457.99  | 345.75  | 302.39  | 397.87  | 235.35  | 219.92  | 409.75
Health Care    | 0       | 0       | 0       | 0       | 0       | 0       | 0       | 0       | 106.01  | 0       | 0       | 200
Insurance      | 251.51  | 273.41  | 249.75  | 249.75  | 249.75  | 249.75  | 249.75  | 249.75  | 249.75  | 289.41  | 289.42  | 289.42
Internet       | 15.98   | 15.98   | 35.97   | 15.98   | 15.98   | 0.99    | 15.98   | 15.98   | 15.98   | 15.98   | 15.98   | 15.98
Lodging        | 0       | 0       | 0       | 0       | 0       | 0       | 0       | 299.73  | 0       | 0       | 0       | 0
Merchandise    | 473.87  | 436.03  | 770.08  | 283.09  | 329.14  | 348.02  | 5344.55 | 503.8   | 444.47  | 960.31  | 662.56  | 398.07
Other          | 365     | 0       | 0       | 0       | 0       | 0       | 0       | 0       | 0       | 162     | 0       | 0
... (5 rows omitted)

In [38]:
spending.where('Transaction','2022-01').where('Category','Dining')

Transaction Date | Posted Date | Card No. | Description            | Category | Debit | Credit | Transaction
2022-01-31       | 2022-02-01  | 7100     | HIMAWARI TEI           | Dining   | 40    | nan    | 2022-01
2022-01-30       | 2022-01-31  | 7100     | DD DOORDASH TACOBELL   | Dining   | 21.92 | nan    | 2022-01
2022-01-30       | 2022-01-31  | 7100     | DD DOORDASH PHOLITTLE  | Dining   | 32.32 | nan    | 2022-01
2022-01-29       | 2022-01-31  | 7100     | DOORDASH DASHPASS      | Dining   | nan   | 9.99   | 2022-01
2022-01-29       | 2022-01-31  | 7100     | TST* NOODLEOSOPHY - SA | Dining   | 28.65 | nan    | 2022-01
2022-01-28       | 2022-01-29  | 7100     | ICICLE CREAM ROLL      | Dining   | 13.23 | nan    | 2022-01
2022-01-28       | 2022-01-29  | 7100     | REDWOOD SKYLINE        | Dining   | 11.6  | nan    | 2022-01
2022-01-28       | 2022-01-29  | 7100     | PEET'S #04502          | Dining   | 4.25  | nan    | 2022-01
2022-01-26       | 2022-01-27  | 7100     | MAJIKKU RAMEN          | Dining   | 46    | nan    | 2022-01
2022-01-24       | 2022-01-25  | 7100     | PEET'S #04502          | Dining   | 3.25  | nan    | 2022-01
... (28 rows omitted)

Let's use the function we just created to add a new column to our `spending` table.

In [ ]:
#creates the array of outputs from our transaction month/year function
transaction_month = spending.apply(extract_month_year,'') 

#Now we add that array to the spending table
spending = spending.with_column( '' , transaction_month)

In [ ]:
#Time to pivot!
...